<?php
//
//    ______         ______           __         __         ______
//   /\  ___\       /\  ___\         /\_\       /\_\       /\  __ \
//   \/\  __\       \/\ \____        \/\_\      \/\_\      \/\ \_\ \
//    \/\_____\      \/\_____\     /\_\/\_\      \/\_\      \/\_\ \_\
//     \/_____/       \/_____/     \/__\/_/       \/_/       \/_/ /_/
//
//   上海商创网络科技有限公司
//
//  ---------------------------------------------------------------------------------
//
//   一、协议的许可和权利
//
//    1. 您可以在完全遵守本协议的基础上，将本软件应用于商业用途；
//    2. 您可以在协议规定的约束和限制范围内修改本产品源代码或界面风格以适应您的要求；
//    3. 您拥有使用本产品中的全部内容资料、商品信息及其他信息的所有权，并独立承担与其内容相关的
//       法律义务；
//    4. 获得商业授权之后，您可以将本软件应用于商业用途，自授权时刻起，在技术支持期限内拥有通过
//       指定的方式获得指定范围内的技术支持服务；
//
//   二、协议的约束和限制
//
//    1. 未获商业授权之前，禁止将本软件用于商业用途（包括但不限于企业法人经营的产品、经营性产品
//       以及以盈利为目的或实现盈利产品）；
//    2. 未获商业授权之前，禁止在本产品的整体或在任何部分基础上发展任何派生版本、修改版本或第三
//       方版本用于重新开发；
//    3. 如果您未能遵守本协议的条款，您的授权将被终止，所被许可的权利将被收回并承担相应法律责任；
//
//   三、有限担保和免责声明
//
//    1. 本软件及所附带的文件是作为不提供任何明确的或隐含的赔偿或担保的形式提供的；
//    2. 用户出于自愿而使用本软件，您必须了解使用本软件的风险，在尚未获得商业授权之前，我们不承
//       诺提供任何形式的技术支持、使用担保，也不承担任何因使用本软件而产生问题的相关责任；
//    3. 上海商创网络科技有限公司不对使用本产品构建的商城中的内容信息承担责任，但在不侵犯用户隐
//       私信息的前提下，保留以任何方式获取用户信息及商品信息的权利；
//
//   有关本产品最终用户授权协议、商业授权与技术服务的详细内容，均由上海商创网络科技有限公司独家
//   提供。上海商创网络科技有限公司拥有在不事先通知的情况下，修改授权协议的权力，修改后的协议对
//   改变之日起的新授权用户生效。电子文本形式的授权协议如同双方书面签署的协议一样，具有完全的和
//   等同的法律效力。您一旦开始修改、安装或使用本产品，即被视为完全理解并接受本协议的各项条款，
//   在享有上述条款授予的权力的同时，受到相关的约束和限制。协议许可范围以外的行为，将直接违反本
//   授权协议并构成侵权，我们有权随时终止授权，责令停止损害，并保留追究相关责任的权力。
//
//  ---------------------------------------------------------------------------------
//
defined('IN_ECJIA') or exit('No permission resources.');

/**
 * ECJIA 流量统计语言文件
 */
return array(
	'tab_general' 	=> '综合访问量',
	'tab_area' 		=> '地区分布',
	'tab_from' 		=> '来源网站',
		
	'general_stats' => '综合访问量统计',
	'area_stats'	=> '地区分布统计',
	'from_stats' 	=> '来源网站统计',
		
	'url' 			=> '地址',
	'area' 			=> '地区',
	'input_url' 	=> '直接输入地址',
	'date' 			=> '日期',
	'access_count' 	=> '访问量',
	'access_query' 	=> '查询',
	'compare_query' => '对比查询',
		
	'start_date' 	=> '开始日期',
	'end_date' 		=> '结束日期',
		
	'down_flow_stats' => '流量分析报表下载',
	'flow_statistics' => '流量分析报表',
		
	//追加
	'traffic_analysis' 	=>	'流量分析',
	'down_general'		=>	'综合访问量报表下载',
	'down_area'			=>	'地区分布报表下载',
	'down_from'			=>	'来源网站报表下载',
	'tody'				=>	'今天',
	'yesterday'			=>	'昨天',
	'last_7'			=>	'最近7天',
	'last_30'			=>	'最近30天',
	'start_date_two' 	=> 	'开始日期：',
	'end_date_two' 		=> 	'结束日期：',
	'inquire' 			=> 	'查询',
	'top15'				=>	'地区分布TOP15图表',	
	'from_top15'		=>	'来源网站TOP15图表',
	'loading'			=>	'正在加载中……',
	'area_list'			=>	'地区分布列表',
	'tips'				=>	'温馨提示：',
	'general_tips'		=>	'综合访问量图表默认显示当年每月的访问量',
	'select_year'		=>	'按年份查询：',
	'or'				=>	'或'	,
	'select_month'		=>	'按月份查询：',
	'all_sources'		=>	'全部来源',
	'external_link'		=>	'外部链接',
	'search_engine'		=>	'搜索引擎',
	'from_web_list'		=>	'来源网站列表',
	'from_type'			=>	'来源类型',
	'pageviews'			=>	'浏览量',
	
	'pageviews_account'	=> '浏览量占比',
	'visits'			=> '访问次数',
	'quantity'			=> '数量',
	'report_statistics'	=> '报表统计',
	
	'overview'             	=> '概述',
	'more_info'             => '更多信息：',
	
	'general_stats_help'	=> '欢迎访问ECJia智能后台综合访问量页面，系统上所有的综合访问量信息都会显示在此页面上。',
	'about_general_stats'	=> '关于综合访问量帮助文档',
	
	'area_stats_help'		=> '欢迎访问ECJia智能后台地区分布页面，系统上所有的地区分布信息都会显示在此页面上。',
	'about_area_stats'		=> '关于地区分布帮助文档',
	
	'from_stats_help'		=> '欢迎访问ECJia智能后台来源网站页面，系统上所有的来源网站信息都会显示在此页面上。',
	'about_from_stats'		=> '关于来源网站帮助文档',
	
	'direct_access'			=> '直接访问',
	'search_engine'			=> '搜索引擎',
	'external_link'			=> '外部链接',
	'baidu'					=> '百度',
	'google'				=> '谷歌',
	'haosou'				=> '好搜',
	'sougou'				=> '搜狗',
	'bing'					=> 'bing',
	'youdao'				=> '有道',
	'other'					=> '其他',
	
	'js_lang' => array(
		'start_date_required'	=> '查询的开始时间不能为空！',
		'end_date_required'		=> '查询的结束时间不能为空！',
		'start_lt_end_date'		=> '查询的开始时间不能超于结束时间！',
		'range_error'			=> '非常抱歉，时间查询范围不能超出90天！',
		'no_records'			=> '没有找到任何记录',
		'month_list' 			=> array('一月', '二月', '三月', '四月', '五月', '六月', '七月', '八月', '九月', '十月', '十一月', '十二月'),
		'times'					=> '次',
		'area_percent'			=> '地区分布百分比',
		'from_percent'			=> '来源网站百分比',
		'from_type_required'	=> '请选择来源类型！',
		'time_required'			=> '查询的时间不能为空！',
	),	
);

//end