<?php
//
//    ______         ______           __         __         ______
//   /\  ___\       /\  ___\         /\_\       /\_\       /\  __ \
//   \/\  __\       \/\ \____        \/\_\      \/\_\      \/\ \_\ \
//    \/\_____\      \/\_____\     /\_\/\_\      \/\_\      \/\_\ \_\
//     \/_____/       \/_____/     \/__\/_/       \/_/       \/_/ /_/
//
//   上海商创网络科技有限公司
//
//  ---------------------------------------------------------------------------------
//
//   一、协议的许可和权利
//
//    1. 您可以在完全遵守本协议的基础上，将本软件应用于商业用途；
//    2. 您可以在协议规定的约束和限制范围内修改本产品源代码或界面风格以适应您的要求；
//    3. 您拥有使用本产品中的全部内容资料、商品信息及其他信息的所有权，并独立承担与其内容相关的
//       法律义务；
//    4. 获得商业授权之后，您可以将本软件应用于商业用途，自授权时刻起，在技术支持期限内拥有通过
//       指定的方式获得指定范围内的技术支持服务；
//
//   二、协议的约束和限制
//
//    1. 未获商业授权之前，禁止将本软件用于商业用途（包括但不限于企业法人经营的产品、经营性产品
//       以及以盈利为目的或实现盈利产品）；
//    2. 未获商业授权之前，禁止在本产品的整体或在任何部分基础上发展任何派生版本、修改版本或第三
//       方版本用于重新开发；
//    3. 如果您未能遵守本协议的条款，您的授权将被终止，所被许可的权利将被收回并承担相应法律责任；
//
//   三、有限担保和免责声明
//
//    1. 本软件及所附带的文件是作为不提供任何明确的或隐含的赔偿或担保的形式提供的；
//    2. 用户出于自愿而使用本软件，您必须了解使用本软件的风险，在尚未获得商业授权之前，我们不承
//       诺提供任何形式的技术支持、使用担保，也不承担任何因使用本软件而产生问题的相关责任；
//    3. 上海商创网络科技有限公司不对使用本产品构建的商城中的内容信息承担责任，但在不侵犯用户隐
//       私信息的前提下，保留以任何方式获取用户信息及商品信息的权利；
//
//   有关本产品最终用户授权协议、商业授权与技术服务的详细内容，均由上海商创网络科技有限公司独家
//   提供。上海商创网络科技有限公司拥有在不事先通知的情况下，修改授权协议的权力，修改后的协议对
//   改变之日起的新授权用户生效。电子文本形式的授权协议如同双方书面签署的协议一样，具有完全的和
//   等同的法律效力。您一旦开始修改、安装或使用本产品，即被视为完全理解并接受本协议的各项条款，
//   在享有上述条款授予的权力的同时，受到相关的约束和限制。协议许可范围以外的行为，将直接违反本
//   授权协议并构成侵权，我们有权随时终止授权，责令停止损害，并保留追究相关责任的权力。
//
//  ---------------------------------------------------------------------------------
//
defined('IN_ECJIA') or exit('No permission resources.');

/**
 * ECJIA 应用语言包
 */
return array(
	'promotion'				=> '促销商品',
	'promotion_list'		=> '促销商品列表',
	'add_promotion'			=> '添加促销商品',
	'promotion_exist'		=> '您选择的商品目前正在进行促销活动，请选择其他商品',
	'promotion_invalid'		=> '请输入一个有效的促销时间',
	'return_promotion_list'	=> '返回促销商品列表',
	'continue_add_promotion'=> '继续添加促销商品',
	'add_promotion_success'	=> '添加促销商品成功',
	'edit_promotion'		=> '编辑促销商品',
	'edit_promotion_success'=> '编辑促销商品成功',
	'remove_success'		=> '删除成功',
		
	'label_goods_keywords'	=> '商品关键字：',
	'lable_goods'			=> '选择活动商品：',
	'pls_select'			=> '请选择...',
	'select_goods_notice'	=> '需要先搜索商品，生成商品列表，然后再选择',
	'label_start_time'		=> '活动开始时间：',
	'label_end_time'		=> '活动结束时间：',
	'select_start_time'		=> '请选择活动开始时间',
	'select_end_time'		=> '请选择活动结束时间',
	'label_price'			=> '活动价格：',
	'start_lt_end'			=> '促销开始时间不能大于或等于结束时间',
		
	'update'	=> '更新',
	'search' 	=> '搜索',
	'all'		=> '全部',
	'on_sale'	=> '正在进行中',
	'coming'	=> '即将开始',
	'finished'	=> '已结束',
	'merchant'	=> '商家',
		
	'goods_keywords'	=> '请输入商品名称关键字',
	'merchant_keywords' => '请输入商家名称关键字',
	'thumbnail'			=> '缩略图',
	'goods_name'		=> '商品名称',
	'start_time'		=> '开始时间',
	'end_time'			=> '结束时间',
	'promotion_price'	=> '活动价格',
	'drop_confirm'		=> '您确定要删除该促销活动吗？',
	
	'promotion_manage'		=> '促销管理',
	'promotion_goods_manage'=> '促销商品管理',
	'promotion_delete'		=> '删除促销商品',
	'invalid_parameter'		=> '参数无效',
	'promotion_goods_info'	=> '促销商品信息',
	'label_goods_name'		=> '商品名称：',
	'search_goods_notice'	=> '请先点击下面搜索按钮，选择商品',
	'enter_goods_name'		=> '请输入商品名称关键字',
	'search_goods'			=> '搜索商品',
	'filter_goods_name'		=> '筛选搜索到的商品名称',
	'click_add_goods'		=> '点击商品名称选择商品',
	'search_none_info'		=> '没有搜索到任何信息',
	'merchants_name'		=> '商家名称',
	'self'					=> '自营',
	
	'js_lang' => array(
		'select_goods_empty' 	=> '未搜索到商品信息',
		'goods_id_min'			=> '请选择活动商品',
		'start_time_required'	=> '请选择开始时间',
		'end_time_required'		=> '请选择结束时间',
		'price_required'		=> '请填写活动价格',
		'price_min'				=> '活动价格最低为1分钱',	
		'search_none_info'		=> '没有搜索到任何信息',
	),
);

// end