<?php
/**
 * Created by PhpStorm.
 * User: royalwang
 * Date: 2018/11/22
 * Time: 14:47
 */

// ===============================================================================================
// -----------------------------------------------------------------------------------------------
// FRAMEWORK SETTINGS
// $settings
// -----------------------------------------------------------------------------------------------
// ===============================================================================================
return array(
    'menu_title'      => '主题个性化',
    'menu_type'       => 'menu', // menu, submenu, options, theme, etc.
    'menu_slug'       => 'cs-framework',
    'ajax_save'       => true,
    'show_reset_all'  => false,
    'framework_title' => '主题个性化 <small>配置菜单</small>',
);
